Model: "atrous_32init_drop0.2_customLossR727"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 2)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 32) 608         input_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512, 512, 32) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 512, 512, 32) 9248        dropout_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 32) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 64) 18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256, 256, 64) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 256, 64) 36928       dropout_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 128, 128, 64) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 64) 36928       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 128, 128, 64) 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 64) 36928       dropout_3[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 64, 64, 64)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 128)  73856       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 64, 64, 128)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 128)  147584      dropout_4[0][0]                  
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 64, 64, 128)  17664       conv2d_8[0][0]                   
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 64, 64, 128)  17664       conv2d_8[0][0]                   
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 64, 64, 128)  17664       conv2d_8[0][0]                   
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 64, 64, 128)  17664       conv2d_8[0][0]                   
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 64, 64, 128)  17664       conv2d_8[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 640)  0           separable_conv2d_1[0][0]         
                                                                 separable_conv2d_2[0][0]         
                                                                 separable_conv2d_3[0][0]         
                                                                 separable_conv2d_4[0][0]         
                                                                 separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 128, 128, 640 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 704 0           up_sampling2d_1[0][0]            
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 64) 405568      concatenate_2[0][0]              
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 128, 128, 64) 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 128, 128, 64) 36928       dropout_5[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 256, 256, 64) 0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 128 0           up_sampling2d_2[0][0]            
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 256, 256, 32) 36896       concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 256, 256, 32) 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 256, 256, 32) 9248        dropout_6[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 512, 512, 32) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 512, 512, 64) 0           up_sampling2d_3[0][0]            
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 512, 512, 32) 18464       concatenate_4[0][0]              
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 512, 512, 32) 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 512, 512, 32) 9248        dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 512, 512, 3)  867         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 512, 512, 1)  4           conv2d_15[0][0]                  
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 262144, 1)    0           conv2d_16[0][0]                  
==================================================================================================
Total params: 966,119
Trainable params: 966,119
Non-trainable params: 0
__________________________________________________________________________________________________
